Revit 2026 API

# RebarShapeParameters Properties

---

The RebarShapeParameters type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RebarShapeParameters Class

Autodesk.Revit.DB.Structure Namespace